print("idk")
print(23*"1"+8*"P"+9*"1"+"\n1"+
      20*"1"+2*"P"+8*"'"+3*"P"+6*"1"+"\n1"+
      7*"1"+7*"P"+4*"1"+2*"P"+12*"'"+3*"P"+4*"1"+"\n1"+
      4*"1"+3*"P"+7*"'"+2*"P"+2*"1"+"P"+14*"'"+2*"P"+4*"1"+"\n1"+
      3*"1"+12*"'"+3*"P"+15*"'"+2*"P"+4*"1"+"\n1"+
      "1"+2*"P"+14*"'"+2*"P"+2*"'"+4*"P"+9*"'"+2*"P"+3*"1"+"\n1"+
      "1"+"P"+10*"'"+3*"P"+2*"P"+2*"P"+2*"'"+5*"P"+8*"'"+2*"P"+3*"1"+"\n1"+
      "1"+"P"+9*"'"+5*"P"+2*"'"+2*"P"+2*"'"+3*"P"+9*"'"+2*"P"+3*"1"+"\n1"+
      "1"+"P"+10*"'"+3*"P"+3*"'"+3*"P"+11*"'"+4*"P"+3*"1"+"\n1"+
      "1"+2*"P"+14*"'"+2*"P"+"1"+3*"P"+8*"'"+3*"P"+2*"1"+2*"P"+"1"+"\n1"+
      2*"1"+2*"P"+12*"'"+4*"P"+4*"1"+8*"P"+4*"1"+2*"P"+"1"+"\n1"+
      3*"1"+2*"P"+10*"'"+3*"P"+"'"+20*"1"+"\n1"+
      3*"1"+13*"P"+23*"1"+"\n1"+
      39*"1")
print("idk")
a=2.7
b=7.9
c=29.7
d=50
e=90
f=130
g=60
perc=round((a/d+b/e+c/f)*60)
ora=round((a/d+b/e+c/f))
h=8
j=60
print("a.) feladat:\n"+
      20*"-"+"\nA","szükséges idő az egyetemig:",round((a/d)+(b/e)+(c/f),2),"óra","\nb.) feladat:"+
      "\n-"+19*"-"+"\nA szükséges idő az egyetemig:",round((a/d+b/e+c/f)*60),"perc","\nc.) feladat:"
      "\n-"+19*"-"+"\nAz indulási idő:",h-1,":",j-perc)


def ev_szin(ev):
      if ev < 1984 or ev > 2043:
            return "Az év nincs a tartományban (1984-2043)."
      pozicio = (ev - 1984) % 60 + 1
      if pozicio in [1, 2, 11, 12, 21, 22, 31, 32, 41, 42, 51, 52]:
            return "Zöld"
      elif pozicio in [3, 4, 13, 14, 23, 24, 33, 34, 43, 44, 53, 54]:
            return "Piros"
      elif pozicio in [5, 6, 15, 16, 25, 26, 35, 36, 45, 46, 55, 56]:
            return "Sárga"
      elif pozicio in [7, 8, 17, 18, 27, 28, 37, 38, 47, 48, 57, 58]:
            return "Fehér"
      elif pozicio in [9, 10, 19, 20, 29, 30, 39, 40, 49, 50, 59, 60]:
            return "Fekete"
ev = int(input("Add meg az évet (1984-2043): "))
print("Az év színe: " + ev_szin(ev))

